Repository: unix14/TodoListApp
Catalog: lib/l10n/intl_*.arb
Languages: he

# title
source: Todo List
he: רשימת מטלות

# enterTodoTextPlaceholder
source: Enter a new todo item...
he: הכנס משימה חדשה...

# addTodoButtonText
source: Add
he: הוסף

# emptyTodoDialogTitle
source: Empty Todo
he: משימה ריקה

# emptyTodoDialogMessage
source: You cannot add an empty todo item.
he: לא ניתן להוסיף משימה ריקה.

# okButtonText
source: OK
he: אישור

source: Settings
he: הגדרות

source: Archive
he: ארכיון

# appIsInstalled
source: App is already installed
he: האפליקציה כבר מותקנת

source: Install App
he: התקן אפליקציה

source: Login
he: התחבר

# areUsure
source: Are you sure?
he: האם אתה בטוח?

# deleteAllSubtext
source: This will delete all todos. This action cannot be undone.
he: פעולה זו תמחק את כל המשימות. לא ניתן לשחזר פעולה זו.

# deleteAllSubtitle
source: Delete All
he: מחק הכל

source: Close
he: סגור

source: Archived Todos
he: משימות בארכיון

# archivedTodosSubtitle
source: Completed todos will be automatically archived after 1 day and will be shown here.
he: משימות שהושלמו יועברו לארכיון אוטומטית לאחר יום ויוצגו כאן.

# doUwant2Delete
source: Do you want to delete this item?
he: האם ברצונך למחוק פריט זה?

# thisCantBeUndone
source: This action cannot be undone.
he: לא ניתן לשחזר פעולה זו.

source: All
he: הכל

# addCategoryTooltip
source: Add new category
he: הוסף קטגוריה חדשה

# addCategoryDialogTitle
source: Add New Category
he: הוסף קטגוריה חדשה

# categoryNameHintText
source: Category Name
he: שם הקטגוריה

# categoryNameEmptyError
source: Category name cannot be empty.
he: שם קטגוריה אינו יכול להיות ריק.

# categoryNameExistsError
source: Category with this name already exists.
he: קטגוריה בשם זה כבר קיימת.

# cancelButtonText
source: Cancel
he: ביטול

# editMenuItem
source: Edit
he: ערוך

# moveToCategoryMenuItem
source: Move to category
he: העבר לקטגוריה

# deleteMenuItem
source: Delete
he: מחק

# selectCategoryDialogTitle
source: Select Category
he: בחר קטגוריה

# uncategorizedCategory
source: Uncategorized
he: ללא קטגוריה

# addNewCategoryMenuItem
source: Add New Category...
he: הוסף קטגוריה חדשה...

# itemMovedSnackbar
source: Item moved to {categoryName}
he: הפריט הועבר ל{categoryName}

# itemUncategorizedSnackbar
source: Item moved to Uncategorized
he: הפריט הועבר ללא קטגוריה

# editTaskHintText
source: Edit task text...
he: ערוך את טקסט המשימה...

# randomTaskMenuButton
source: Random Task
he: משימה אקראית

# noTasksAvailableDialogTitle
source: No Tasks Available
he: אין משימות זמינות

# noTasksAvailableDialogMessage
source: There are no uncompleted tasks in the current filter to choose from.
he: אין משימות שלא הושלמו במסנן הנוכחי לבחירה.

# randomTaskDialogTitle
source: Your Random Task
he: המשימה האקראית שלך

# renameCategoryMenuButton
source: Rename Current Category
he: שנה שם קטגוריה נוכחית

# deleteCategoryMenuButton
source: Delete Current Category
he: מחק קטגוריה נוכחית

# renameCategoryDialogTitle
source: Rename Category
he: שנה שם קטגוריה

# renameButtonText
source: Rename
he: שנה שם

# categoryRenamedSnackbar
source: Category '{oldName}' renamed to '{newName}'
he: שם הקטגוריה '{oldName}' שונה ל'{newName}'

# deleteCategoryConfirmationTitle
source: Delete Category?
he: למחוק קטגוריה?

# deleteCategoryConfirmationMessage
source: Are you sure you want to delete the category '{categoryName}'? Tasks in this category will become uncategorized.
he: האם אתה בטוח שברצונך למחוק את הקטגוריה '{categoryName}'? משימות בקטגוריה זו יהפכו ללא קטגוריה.

# categoryDeletedSnackbar
source: Category '{categoryName}' deleted.
he: הקטגוריה '{categoryName}' נמחקה.

# tasksCountSingular
source: 1 task
he: משימה אחת

# tasksCount
source: {count} tasks
he: {count} משימות

# tasksCountZero
source: No tasks
he: אין משימות

# motivationalSentence1
source: Great things never come from comfort zones. Let's tackle a task!
he: דברים גדולים לעולם לא מגיעים מאזורי נוחות. בוא נתמודד עם משימה!

# motivationalSentence2
source: The secret of getting ahead is getting started. What's first?
he: הסוד להתקדם הוא להתחיל. מה הדבר הראשון?

# motivationalSentence3
source: An empty list is a blank canvas. Paint your masterpiece of productivity!
he: רשימה ריקה היא בד ציור ריק. צייר את יצירת המופת שלך בפרודוקטיביות!

# motivationalSentence4
source: Don't watch the clock; do what it does. Keep going! Add a task.
he: אל תסתכל על השעון; עשה מה שהוא עושה. המשך להתקדם! הוסף משימה.

# motivationalSentence5
source: The journey of a thousand miles begins with a single step... or a single task!
he: המסע של אלף מייל מתחיל בצעד אחד... או במשימה אחת!

# searchTodosHint
source: Search Todos...
he: חפש משימות...

# closeSearchTooltip
source: Close Search
he: סגור חיפוש

# searchTodosTooltip
source: Search Todos
he: חפש משימות

# noResultsFound
source: No results found for '{query}'
he: לא נמצאו תוצאות עבור '{query}'

# resultsInCategory
source: Results in {categoryName}
he: תוצאות בקטגוריה {categoryName}

# uncategorizedResults
source: Results in Uncategorized
he: תוצאות ללא קטגוריה
